blog-posts/2004-02-17-emacs-learning-instruction-program-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Learning Instruction Program</title>
<!-- 2014-04-30 Wed 17:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs Learning Instruction Program</h1>
<p>
February 17th, 2004 -
<a href="http://sachachua.com/blog/p/1721"><a href="http://sachachua.com/blog/p/1721">http://sachachua.com/blog/p/1721</a></a>
</p>

<blockquote>
<p>
The beta of ELIP, the Emacs Learning Instruction Program, is now
 stable enough for wide release.
</p>

<p>
ELIP is “flashcards on steroids” and provides learning via
</p>

<ul class="org-ul">
<li>spaced interval recall (like SuperMemo)
<ul class="org-ul">
<li>Leitner “box” method
</li>
<li>plain old flashcards
</li>
</ul>
</li>
</ul>

<p>
Modes are present for questions and answers in
</p>

<ul class="org-ul">
<li>simple form
<ul class="org-ul">
<li>ellipsis form, generated from chosen text material
</li>
<li>passage memorization form (i.e., memorize the Gettysburg address).
</li>
</ul>
</li>
</ul>

<p>
ELIP installation requires some EMACS ‘smarts' and had EDB, the EMACS
 Database, as a prerequisite. This is all explained in the
 documentation.
</p>

<p>
The distribution comes with a small Hawaiian language database, a
 large Spanish vocabulary database, a large Esperanto vocabulary
 database, an Esperanto grammar database, and the “I Have a Dream”
 speech for learning by memorization.
</p>

<p>
There is a small, low volume mailing list available.
</p>

<p>
ELIP is found at
</p>

<p>
<a href="http://www.chungkuo.org/elisp/elip.zip"><a href="http://www.chungkuo.org/elisp/elip.zip">http://www.chungkuo.org/elisp/elip.zip</a></a>
</p>

<p>
and comments, bug reports, ideas and suggestions are welcome.
</p>
</blockquote>

<p>
E-Mail from ChipsChap
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
